# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCTransformSetter..::..Dispose Method
IFCTransformSetter Class See Also
---
Releases all resources used by the IFCTransformSetter
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace